# Задание 1

# Поработайте с переменными, создайте несколько, выведите на экран.
# Запросите у пользователя некоторые числа и строки и сохраните в переменные, затем выведите на экран.

num = 123
word = "Hello"
print(num, word)

name = input("Ваше имя?")
age = input("ВАш возраст?")
print(name, age)
